"""
邢不行™️选股框架
Python股票量化投资课程

版权所有 ©️ 邢不行
微信: xbx8662

未经授权，不得复制、修改、或使用本代码的全部或部分内容。仅限个人学习用途，禁止商业用途。

Author: 邢不行
"""
import pandas as pd

fin_cols = []  # 财务因子列
ov_cols = ['机构资金买入额', '大户资金买入额', '中户资金买入额', '散户资金买入额', '机构资金卖出额', '大户资金卖出额', '中户资金卖出额', '散户资金卖出额']

def add_factor(df: pd.DataFrame, param=None, **kwargs) -> pd.DataFrame:
    """
    计算并将新的因子列添加到股票行情数据中，并返回包含计算因子的DataFrame及其聚合方式。

    工作流程：
    1. 根据提供的参数计算股票的因子值。
    2. 将因子值添加到原始行情数据DataFrame中。

    :param df: pd.DataFrame，包含单只股票的K线数据，必须包括市场数据（如收盘价等）。
    :param param: 因子计算所需的参数，格式和含义根据因子类型的不同而有所不同。
    :param kwargs: 其他关键字参数，包括：
        - col_name: 新计算的因子列名。
        - fin_data: 财务数据字典，格式为 {'财务数据': fin_df, '原始财务数据': raw_fin_df}，其中fin_df为处理后的财务数据，raw_fin_df为原始数据，后者可用于某些因子的自定义计算。
        - 其他参数：根据具体需求传入的其他因子参数。
    :return:
        - pd.DataFrame: 包含新计算的因子列，与输入的df具有相同的索引。

    注意事项：
    - 如果因子的计算涉及财务数据，可以通过`fin_data`参数提供相关数据。
    """
    """    
    ----->>>  配置方法  <<<-----
    配置：('资金流买入成交额波动性比', is_sort_asc, [acc, n], arg)
    含义：资金流买入成交额波动性比 = STD(XX资金买入额, n) / STD(成交额, n)
    示例：'factor_list': [
                            ('资金流买入成交额波动性比', True, ['机构', 10], 1),         # 资金流买入成交额波动性比_机构_10
                            ('资金流买入成交额波动性比', True, ['大户', 10], 1),         # 资金流买入成交额波动性比_大户_10
                            ('资金流买入成交额波动性比', True, ['中户', 10], 1),         # 资金流买入成交额波动性比_中户_10
                            ('资金流买入成交额波动性比', True, ['散户', 10], 1),         # 资金流买入成交额波动性比_散户_10
                            ('资金流买入成交额波动性比', True, ['主力', 10], 1),         # 资金流买入成交额波动性比_机构+大户_10
                            ('资金流买入成交额波动性比', True, ['中大户', 10], 1),         # 资金流买入成交额波动性比_中户+大户_10
                            ('资金流买入成交额波动性比', True, ['中小户', 10], 1),         # 资金流买入成交额波动性比_中户+散户_10
                            ('资金流买入成交额波动性比', True, ['非机构', 10], 1),         # 资金流买入成交额波动性比_散户+中户+大户_10
                            ('资金流买入成交额波动性比', True, ['非散户', 10], 1),         # 资金流买入成交额波动性比_机构+大户+中户_10    
                        ]
    """
    # 从kwargs中提取因子列的名称
    col_name = kwargs['col_name']
    # 参数规范化处理
    try:
        acc, n = param
        n = int(n)
    except (TypeError, ValueError):
        raise ValueError("param参数必须是一个包含2个元素的序列(acc, n)")

    valid_acc = ['机构', '大户', '中户', '散户', '主力', '中大户', '中小户', '非机构', '非散户']
    if acc not in valid_acc:
        raise ValueError(f"无效的资金流参数: {acc}. 有效值为: {valid_acc}")
    # 户别选择
    if acc in ['机构', '大户', '中户', '散户']:
        df[f'资金买入额_{acc}'] = df[f'{acc}资金买入额']
    elif acc == '主力':
        df[f'资金买入额_{acc}'] = df['机构资金买入额'] + df['大户资金买入额']
    elif acc == '中大户':
        df[f'资金买入额_{acc}'] = df['中户资金买入额'] + df['大户资金买入额']
    elif acc == '中小户':
        df[f'资金买入额_{acc}'] = df['中户资金买入额'] + df['散户资金买入额']
    elif acc == '非机构':
        df[f'资金买入额_{acc}'] = df['大户资金买入额'] + df['中户资金买入额'] + df['散户资金买入额']
    elif acc == '非散户':
        df[f'资金买入额_{acc}'] = df['大户资金买入额'] + df['中户资金买入额'] + df['机构资金买入额']

    # 核心计算逻辑
    df[f'资金流买入成交额波动性比_{acc}_{n}'] = df[f'资金买入额_{acc}'].rolling(n).std() / df[f'成交额'].rolling(n).std()
    factor_col = df[f'资金流买入成交额波动性比_{acc}_{n}']
    del  df[f'资金买入额_{acc}']
    # 创建包含指定因子的DataFrame
    factor_df = pd.DataFrame({col_name: factor_col}, index=df.index)

    return factor_df
